; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 555226 2 2 2 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Phenomenon3 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite1 Planet6)
	(have_image Phenomenon3 image1)
	(have_image Star4 infrared0)
	(have_image Star5 infrared0)
	(have_image Planet6 image1)
	(have_image Star7 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
4. (turn_to satellite1 groundstation2 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 6
5. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 6
6. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 0 of 6
7. (turn_to satellite1 star5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star5)
   goals met: 0 of 6
8. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
9. (take_image satellite1 star5 instrument2 infrared0)
   added: (have_image star5 infrared0)
   goals met: 1 of 6
10. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 1 of 6
11. (turn_to satellite1 planet6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet6)
   goals met: 2 of 6
12. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 6
13. (take_image satellite1 planet6 instrument2 image1)
   added: (have_image planet6 image1)
   goals met: 3 of 6
14. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 3 of 6
15. (turn_to satellite1 star4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star4)
   goals met: 2 of 6
16. (turn_to satellite0 star7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star7)
   goals met: 2 of 6
17. (take_image satellite1 star4 instrument2 infrared0)
   added: (have_image star4 infrared0)
   goals met: 3 of 6
18. (take_image satellite0 star7 instrument0 image1)
   added: (have_image star7 image1)
   goals met: 4 of 6
19. (turn_to satellite1 planet6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet6)
   goals met: 5 of 6
20. (turn_to satellite0 phenomenon3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon3)
   goals met: 5 of 6
21. (take_image satellite0 phenomenon3 instrument0 image1)
   added: (have_image phenomenon3 image1)
   goals met: 6 of 6
